espressif/esp-idf/components/soc/esp32h4/register/soc/pvt_struct.h
/**
 * SPDX-FileCopyrightText: 2025 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0 OR MIT
 */
#pragma once

#include <stdint.h>
#ifdef __cplusplus
extern "C" {
#endif

/** Group: configure register */
/** Type of pmup_bitmap_high0 register
 *  select valid pvt channel
 */
typedef union {
    struct {
        /** pump_bitmap_high0 : R/W; bitpos: [31:0]; default: 0;
         *  select valid high channel0
         */
        uint32_t pump_bitmap_high0:32;
    };
    uint32_t val;
} pvt_pmup_bitmap_high0_reg_t;

/** Type of pmup_bitmap_high1 register
 *  select valid pvt channel
 */
typedef union {
    struct {
        /** pump_bitmap_high1 : R/W; bitpos: [31:0]; default: 0;
         *  select valid high channel1
         */
        uint32_t pump_bitmap_high1:32;
    };
    uint32_t val;
} pvt_pmup_bitmap_high1_reg_t;

/** Type of pmup_bitmap_high2 register
 *  select valid pvt channel
 */
typedef union {
    struct {
        /** pump_bitmap_high2 : R/W; bitpos: [31:0]; default: 0;
         *  select valid high channel2
         */
        uint32_t pump_bitmap_high2:32;
    };
    uint32_t val;
} pvt_pmup_bitmap_high2_reg_t;

/** Type of pmup_bitmap_high3 register
 *  select valid pvt channel
 */
typedef union {
    struct {
        /** pump_bitmap_high3 : R/W; bitpos: [31:0]; default: 0;
         *  select valid high channel3
         */
        uint32_t pump_bitmap_high3:32;
    };
    uint32_t val;
} pvt_pmup_bitmap_high3_reg_t;

/** Type of pmup_bitmap_high4 register
 *  select valid pvt channel
 */
typedef union {
    struct {
        /** pump_bitmap_high4 : R/W; bitpos: [31:0]; default: 0;
         *  select valid high channel4
         */
        uint32_t pump_bitmap_high4:32;
    };
    uint32_t val;
} pvt_pmup_bitmap_high4_reg_t;

/** Type of pmup_bitmap_low0 register
 *  select valid pvt channel
 */
typedef union {
    struct {
        /** pump_bitmap_low0 : R/W; bitpos: [31:0]; default: 0;
         *  select valid low channel0
         */
        uint32_t pump_bitmap_low0:32;
    };
    uint32_t val;
} pvt_pmup_bitmap_low0_reg_t;

/** Type of pmup_bitmap_low1 register
 *  select valid pvt channel
 */
typedef union {
    struct {
        /** pump_bitmap_low1 : R/W; bitpos: [31:0]; default: 0;
         *  select valid low channel1
         */
        uint32_t pump_bitmap_low1:32;
    };
    uint32_t val;
} pvt_pmup_bitmap_low1_reg_t;

/** Type of pmup_bitmap_low2 register
 *  select valid pvt channel
 */
typedef union {
    struct {
        /** pump_bitmap_low2 : R/W; bitpos: [31:0]; default: 0;
         *  select valid low channel2
         */
        uint32_t pump_bitmap_low2:32;
    };
    uint32_t val;
} pvt_pmup_bitmap_low2_reg_t;

/** Type of pmup_bitmap_low3 register
 *  select valid pvt channel
 */
typedef union {
    struct {
        /** pump_bitmap_low3 : R/W; bitpos: [31:0]; default: 0;
         *  select valid low channel3
         */
        uint32_t pump_bitmap_low3:32;
    };
    uint32_t val;
} pvt_pmup_bitmap_low3_reg_t;

/** Type of pmup_bitmap_low4 register
 *  select valid pvt channel
 */
typedef union {
    struct {
        /** pump_bitmap_low4 : R/W; bitpos: [31:0]; default: 0;
         *  select valid low channel4
         */
        uint32_t pump_bitmap_low4:32;
    };
    uint32_t val;
} pvt_pmup_bitmap_low4_reg_t;

/** Type of pmup_drv_cfg register
 *  configure pump drv
 */
typedef union {
    struct {
        uint32_t reserved_0:8;
        /** bypass_efuse_ctrl : R/W; bitpos: [8]; default: 1;
         *  needs desc
         */
        uint32_t bypass_efuse_ctrl:1;
        /** pump_en : R/W; bitpos: [9]; default: 0;
         *  configure pvt charge xpd
         */
        uint32_t pump_en:1;
        /** clk_en : R/W; bitpos: [10]; default: 0;
         *  force register clken
         */
        uint32_t clk_en:1;
        /** pump_drv4 : R/W; bitpos: [14:11]; default: 0;
         *  configure cmd4 drv
         */
        uint32_t pump_drv4:4;
        /** pump_drv3 : R/W; bitpos: [18:15]; default: 0;
         *  configure cmd3 drv
         */
        uint32_t pump_drv3:4;
        /** pump_drv2 : R/W; bitpos: [22:19]; default: 0;
         *  configure cmd2 drv
         */
        uint32_t pump_drv2:4;
        /** pump_drv1 : R/W; bitpos: [26:23]; default: 0;
         *  configure cmd1 drv
         */
        uint32_t pump_drv1:4;
        /** pump_drv0 : R/W; bitpos: [30:27]; default: 0;
         *  configure cmd0 drv
         */
        uint32_t pump_drv0:4;
        uint32_t reserved_31:1;
    };
    uint32_t val;
} pvt_pmup_drv_cfg_reg_t;

/** Type of pmup_channel_cfg register
 *  configure the code of valid pump channel code
 */
typedef union {
    struct {
        uint32_t reserved_0:7;
        /** pump_channel_code4 : R/W; bitpos: [11:7]; default: 0;
         *  configure cmd4 code
         */
        uint32_t pump_channel_code4:5;
        /** pump_channel_code3 : R/W; bitpos: [16:12]; default: 0;
         *  configure cmd3 code
         */
        uint32_t pump_channel_code3:5;
        /** pump_channel_code2 : R/W; bitpos: [21:17]; default: 0;
         *  configure cmd2 code
         */
        uint32_t pump_channel_code2:5;
        /** pump_channel_code1 : R/W; bitpos: [26:22]; default: 0;
         *  configure cmd1 code
         */
        uint32_t pump_channel_code1:5;
        /** pump_channel_code0 : R/W; bitpos: [31:27]; default: 0;
         *  configure cmd0 code
         */
        uint32_t pump_channel_code0:5;
    };
    uint32_t val;
} pvt_pmup_channel_cfg_reg_t;

/** Type of clk_cfg register
 *  configure pvt clk
 */
typedef union {
    struct {
        /** pump_clk_div_num : R/W; bitpos: [7:0]; default: 0;
         *  needs field desc
         */
        uint32_t pump_clk_div_num:8;
        /** monitor_clk_pvt_en : R/W; bitpos: [8]; default: 0;
         *  needs field desc
         */
        uint32_t monitor_clk_pvt_en:1;
        uint32_t reserved_9:22;
        /** clk_sel : R/W; bitpos: [31]; default: 0;
         *  select pvt clk
         */
        uint32_t clk_sel:1;
    };
    uint32_t val;
} pvt_clk_cfg_reg_t;

